N = 10;

I = [1.0000, 1.0000, 1.2536, 1.4866, 1.6136, 1.6136, 1.4866, 1.2536, 1.0000, 1.0000;    %-20dB
    1.0000, 1.6690, 2.5940, 3.3997, 3.8709, 3.8709, 3.3997, 2.5940, 1.6690, 1.0000;   %-30dB
    1.0000, 2.5149, 4.6240, 6.6855, 7.9669, 7.9669, 6.6855, 4.6240, 2.5149, 1.0000;    %-40dB
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1;];  %για ομοιομορφη

A = zeros(1,4);   %Άθροισμα του αριθμητή
B = zeros(1,4);   %Διπλό άθροισμα του παρονομαστή
D = zeros(1,4);
for i = 1:4
    for n = 0:(N-1)
        A(i) = A(i) + I(i, n+1);
        for m = 0:N-1
            if n==m
                B(i) = B(i) + I(i, n+1)*I(i, m+1); %για την περίπτωση sin(0)/0 -> 1
            else
                B(i) = B(i) + I(i, n+1)*I(i, m+1)*sin((n-m)*pi/(n-m));
            end
        end
    end
    D(i) = pi*A(i)^2 / B(i);
end    
D_dB = 10*log10(D);
